---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinProf
source: html/81d816a4-758e-e2f1-b953-994837b7a9f3.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlycolorPerlinProf Property

The property labeled "Profile for earlywood color perlin noise" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodEarlycolorPerlinProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".